import { Question } from '../types/question';

export const questions: Question[] = [
  {
    id: 1,
    text: '人と話すとエネルギーが沸きますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 2,
    text: 'ひとりで過ごすのが好きですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 3,
    text: '初対面の人と話すのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 4,
    text: '人前で話すのが好きですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 5,
    text: '周囲の人と関わることで充実感を得ますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 6,
    text: '静かな環境で集中するのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 7,
    text: '大勢の人と一緒にいると疲れることがありますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 8,
    text: '物事を具体的に考えるのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 9,
    text: 'データや事実に基づいて行動しますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 10,
    text: '抽象的なアイデアよりも実際の結果を重視しますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 11,
    text: '新しい可能性を考えるのが好きですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 12,
    text: '長期的な視野で計画を立てるのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 13,
    text: '規則や手順を守るのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 14,
    text: '将来のビジョンを考えるのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 15,
    text: '決断を下すとき、論理や事実を重視しますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 16,
    text: '他人の気持ちを考えて行動しますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 17,
    text: '議論で勝つことよりも調和を重視しますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 18,
    text: '物事を客観的に判断するのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 19,
    text: 'チームの感情を大切にしますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 20,
    text: '問題を解決するとき、合理性を重視しますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 21,
    text: '他人の価値観を尊重しますか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 22,
    text: '計画を立てて行動するのが好きですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 23,
    text: '締め切りを守るのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 24,
    text: '柔軟に対応するのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 25,
    text: '状況に応じて即興で対応するのが得意ですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 26,
    text: '物事を早めに終わらせるのが好きですか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 27,
    text: 'その場の流れで計画を変えることが苦になりませんか？',
    options: ['はい', 'いいえ'],
  },
  {
    id: 28,
    text: '明確な指示やルールを好みますか？',
    options: ['はい', 'いいえ'],
  },
];